app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('G','NC-17','PG','PG-13','R')) ORDER BY release_date ASC
---
  def index
    @all_ratings = Movie.all_ratings # retrieve all ratings
    if !session[:ratings] # if new session, create a Hash for session
      session[:ratings] = Hash.new(true)
      @all_ratings.each do |movie_rating| # Hash with value 1, but no need to use values (explained in part 2)